import { Text } from './dummy';

export const text1: Text = [
  '[Json]の正規化',
  '\t[Json]は[正規化]するのが良い',
  '\t正規化は[** よいこと]ばかり',
  '[CUE]も良い感じらしい',
];

export const text2: Text = [
  '他者に[依存]しない ',
  '',
  '人間の[依存]をどう定義するか',
  '　「依存」の言葉の定義が曖昧すぎる',
  '　情報は他者に依存しまくっている',
  '　依存の中にも好むものと好まないものがある',
  '　うまく言語化できていないが、超利己的なものであることはわかる',
  '',
  '直感的に許容している依存',
  '	他人が他人のために作ったライブラリ等の使用',
  '	他人が他人のために書いた記事の閲覧',
  '	[他人の自発的な行動による利益]の享受を許容しているのだな',
  '	国というシステム  ',
  '		公共機関とか、学習機関とか',
  '		本当はここも壊さないといけない',
  '			思考を放棄しているので国のような弱者救済装置に頼ってしまっている',
  '			国の存在が前提にある',
  '			「でも日本に頼ってるじゃん」と言われるとぐうの音も出ない',
  '			極論、島を作って独りで生きていけるようなシステムを構築しなければ、依存は解決されない',
];

export const text3: Text = [
  '自分の命より大切なものを見つけたい',
  '	到底出会えるものではないだろうが。',
  '',
  'なんか漠然と、',
  '	正しい死に方をしたい、とか',
  '	死は必ずしもネガティブな意味を持たない、',
  '	みたいなことを証明しながら死にたい、と思ってる',
  '	「正しい」の定義は自分に依る',
  '',
  '死を切望しているわけではなく、意味のある死を切望している',
  '	[死は救済]とこれは両立してて、「死は救済」は、受動的なものなので、それは肯定しているが、理想的ではない',
  '		その意味で、地震とか車の事故ごときで死ぬわけにはいかない',
  '	何かしらの「正しい死」を目指すなら、恐らく[自殺]以外にありえないと思う',
  '	死因は自殺でありたいが、その強い理由が必要',
  '		50歳で見つけられたら万々歳だろう、ぐらいに思ってる',
];

export const text4: Text = [
  '多様性の尊重',
  '	「君(自分にとって異質な人)の[* 存在は認める]が、俺の視界に入らないで欲しい」というのは多様性の尊重と言えるだろうか？',
  '',
  '',
  '例',
  '	君が人を殺したいという欲望があるならそれはそれで良いと思うが、俺のことは殺さないで欲しい',
  '',
  '',
  '	Yesの場合',
  '		大多数がこう思っていれば結局その異質者は存在していい場所がかなり限られてしまうのでは？',
  '			世界は広いからokですか？',
  '	Noの場合',
  '		その異質な人の欲望を自分が受け止めなければいけないのか？',
  '			殺人欲望者を含めて「多様性の尊重」を謳うなら、自分は殺される覚悟が必要なのか？',
  '				きつすぎじゃね？',
  '',
  '',
  '「[多様性]の尊重」ってなに？？？？？？',
];

export const text5: Text = [
  '自分で到達する',
  '	[経営理念]に関する疑問の根源',
  '	に関する疑問の根源',
  '',
  '例えば「ミッションを決めよう」について',
  '	有名な大企業の社長はミッションを作っていたからそれにならおう',
  '		歴史に学ぶのだ！',
  '	多くの起業家がみんな決めてるから決めよう',
  '	投資家はそういうのを欲しがるのだから決めよう',
  '',
  'というノリに疑問が湧いていた',
  '	つければいいの？付ける意味あるの？',
  '	この時点ではただの批判に近い',
  '',
  '会話していて見えてきた疑問の種',
  '',
  'サイクル',
  '	知識を得て、',
  '	自分の中で崩し',
  '	再構成する',
  '',
  'ただ讃えて無思考で受け入れるのでもなく、',
  'ただ批判するのではなく、',
  '自分の中で崩しと再考性が必要',
];

// export const texts = [text1];

export const texts = [text1, text2, text3, text4, text5];
